// pages/analysis-history/analysis-history.js
Page({


  data: {
    date:{
      day1: "2018-7-12",
      day2: "2018-7-08",
      day3: "2018-7-03"

    },
  items:[
    {yc:"时间1，异常1"},
    { yc: "时间2，异常2" },
    { yc: "时间3，异常3" },
    { yc: "时间4，异常4" },
    { yc: "时间5，异常5" },
    { yc: "时间6，异常6" },
    { yc: "时间7，异常7" },
    { yc: "时间8，异常8" }
  ],
  items2:[
      { yc: "时间1，异常1" },
      { yc: "时间2，异常2" },
      { yc: "时间3，异常3" },
      { yc: "时间4，异常4" }
  ],
  items3: [
    { yc: "时间1，异常1" },
    { yc: "时间2，异常2" },
    { yc: "时间3，异常3" }
  ]
  }
})